Revit 2027 API
RebarFreeFormAccessor.StirrupTieAttachmentType Property
 Identifies the StirrupTieAttachmentType of the current Rebar element. The RebarStyle of the Rebar element must be StirrupTie.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StirrupTieAttachmentType StirrupTieAttachmentType { get; set; }
Public Property StirrupTieAttachmentType As StirrupTieAttachmentType
	Get
	Set
public:
property StirrupTieAttachmentType StirrupTieAttachmentType {
	StirrupTieAttachmentType get ();
	void set (StirrupTieAttachmentType value);
}
member StirrupTieAttachmentType : StirrupTieAttachmentType with get, set
Property Value
StirrupTieAttachmentType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace